MX_SOAP_XMLS/PricingWtLimits_ComA_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pric="http://pricing.distribution.ws.murex/">
   <soapenv:Header/>
   <soapenv:Body>
      <pric:indicativePricingWithLimits>
	<XmlProduct productId="Outright">
		<inputs>
			<input name="Instrument" value="EUR/USD"/>
			<input name="Quantity currency" value="EUR"/>
			<input name="Nominal" value="1000"/>
			<input name="Other quantity currency" value="USD"/>
			<input name="B/S" value="Buy"/>
			<input name="Counterpart" value="COMPANY A"/>
			<input name="Maturity period" value="3m"/>
			<input name="W_USER" value="user1"/>
		</inputs>
	</XmlProduct>
	<ConnectedToRealtime  xmlns="">true</ConnectedToRealtime>
	<Timeout duration="2" timeUnit="Minutes"/>
      </pric:indicativePricingWithLimits>
   </soapenv:Body>
</soapenv:Envelope>